PontusO/iLabs_AT_Hearth/platform/esp32c6/sdkconfig.defaults.esp32c6
# iLabs AT Matter - ESP32-C6 target.
#
# The AT+MT link (at_core -> UART1) is wired to GPIO16/17 on this board via the
# RP2350 host bridge - which are also the C6's DEFAULT UART0 console pins. Move
# the console TX to GPIO2 (RX parked on the unused GPIO4) so the boot/log output
# never shares a pin with the AT stream. Same arrangement as the ESP-NOW
# firmware. (Matter logs therefore go to GPIO2, reachable with a separate probe;
# the host talks AT over the bridge on GPIO16/17.)
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_0=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_TX_GPIO=2
CONFIG_ESP_CONSOLE_UART_RX_GPIO=4
